welcome = "✅ <b>Добро пожаловать</b>! ✅"
help = "🗓️ <b>Основные команды</b>\n\n" \
       "/start - запуск бота\n" \
       "/send_money - отправить деньги\n" \
       "/me - личный кабинет\n" \
       "/balance - баланс карты\n" \
       "/accountlist - список счетов в банке\n" \
       "/card_list - список карт"

# phone number
success = "Номер успешно записан ✅"
incorrect = "❗ Введите корректный номер"
not_exist = "Вы еще не ввели номер :з"

# personal account
info = "👤 <b>Личный кабинет</b>"
line = "\n--------------------\n"

# card
balance = "💸 Ваш баланс: "
balance_not_exist = "У вас нет счетов в банке."
account_not_find = "Счет не найден."
account_list = "Ваши счета: \n"

# transactions
no_access = "У вас неподтвержденный акквунт, для подтверждения обратитесь в поддержку"
choose_card = "📋 Выберите карту из выпадающего списка или введите вручную\n\n" \
              "/cancel - отмена операции"
not_found = "❗ Неверный номер, либо карты не существует\n\n<i>*попробуйте снова</i>"
enter_amount = "💰 Введите сумму:"
incorrect_input = "❗ Введите корректное значение"
no_money = "Недостаточно средств на карте :3"
transaction_type = "Выберите тип перевода"
send_to_telegram_id = "Введите Telegram ID для перевода:"
send_to_bank_account = "Введите номер счета для перевода:"
send_to_card_number = "Введите номер карты для перевода:"
pitiful_attempt = "Пытаетесь отправить деньги самому себе??) 🤡"
not_in_favorite = "У этого пользователя неподтвержденный аккаунт"
successful = "✅ Перевод выполнен <b>успешно</b>! ✅"
incorrect_account = "Неверный номер, либо счета не существует"
error = "Что-то пошло не так... перевод не выполнен, обратитесь в поддержку"
cancelled = "❌️ Операция отменена"

# favorite users list
user_not_found = "Пользователь не найден"
user_was_delete = "Пользователь удален из избранного"
user_was_add = "Пользователь добавлен в избранное"
favorite_list = "Избранный список\n\n"
favorite_no_list = "Еще нет пользователей в избранном"
